module.exports = {
  region: region,
  trade: trade,
  capital: capital,
  time: time,
  compony: compony
}
  // 城市
function region() {
  var City = {
    list: [
      {
        "code": 0,
        "title": "全国",
        "underTitle": [{"city": "全国", "code": "0"}]
      },
      {
        "code": 110000,
        "title": "北京市",
        "underTitle": [{ "city": "北京市", "code": "110000" }]
      },
      {
        "code": 120000,
        "title": "天津市",
        "underTitle": [{ "city": "天津市", "code": "120000" }]
      },
      {
        "code": 130000,
        "title": "河北省",
        "underTitle": [{ "code": "130000", "city": "河北全省" },
        { "code": "130100", "city": "石家庄市" },
        { "code": "130200", "city": "唐山市" },
        { "code": "130300", "city": "秦皇岛市" },
        { "code": "130400", "city": "邯郸市" },
        { "code": "130500", "city": "邢台市" },
        { "code": "130600", "city": "保定市" },
        { "code": "130700", "city": "张家口市"},
        { "code": "130800", "city": "承德市" },
        { "code": "130900", "city": "沧州市" },
        { "code": "131000", "city": "廊坊市" },
        { "code": "131100", "city": "衡水市" }]
      },
      {
        "code": 140000,
        "title": "山西省",
        "underTitle": [{ "code": "140000", "city": "山西全省"},
        { "code": "140100", "city": "太原市" },
        { "code": "140200", "city": "大同市" },
        { "code": "140300", "city": "阳泉市" },
        { "code": "140400", "city": "长治市" },
        { "code": "140500", "city": "晋城市" },
        { "code": "140600", "city": "朔州市" },
        { "code": "140700", "city": "晋中市" },
        { "code": "140800", "city": "运城市" },
        { "code": "140900", "city": "忻州市" },
        { "code": "141000", "city": "临汾市" },
        { "code": "141100", "city": "吕梁市" }]
      },
      {
        "code": 150000,
        "title": "内蒙古自治区",
        "underTitle": [{ "code": "150000", "city": "内蒙古全省" },
        { "code": "150100", "city": "呼和浩特市" },
        { "code": "150200", "city": "包头市" },
        { "code": "150300", "city": "乌海市" },
        { "code": "150400", "city": "赤峰市" },
        { "code": "150500", "city": "通辽市" },
        { "code": "150600", "city": "鄂尔多斯市" },
        { "code": "150700", "city": "呼伦贝尔市" },
        { "code": "150800", "city": "巴彦淖尔市" },
        { "code": "150900", "city": "乌兰察布市" },
        { "code": "152200", "city": "兴安盟" },
        { "code": "152500", "city": "锡林郭勒盟" },
        { "code": "152900", "city": "阿拉善盟" }]
      },
      {
        "code": 210000,
        "title": "辽宁省",
        "underTitle": [{ "code": "210000", "city": "辽宁全省" },
        { "code": "210100", "city": "沈阳市" },
        { "code": "210200", "city": "大连市" },
        { "code": "210300", "city": "鞍山市" },
        { "code": "210400", "city": "抚顺市" },
        { "code": "210500", "city": "本溪市" },
        { "code": "210600", "city": "丹东市" },
        { "code": "210700", "city": "锦州市" },
        { "code": "210800", "city": "营口市" },
        { "code": "210900", "city": "阜新市" },
        { "code": "211000", "city": "辽阳市" },
        { "code": "211100", "city": "盘锦市" },
        { "code": "211200", "city": "铁岭市" },
        { "code": "211300", "city": "朝阳市" },
        { "code": "211400", "city": "葫芦岛市" }]
      },
      {
        "code": 220000,
        "title": "吉林省",
        "underTitle": [{ "code": "220000", "city": "吉林全省" },
        { "code": "220100", "city": "长春市" },
        { "code": "220200", "city": "吉林市" },
        { "code": "220300", "city": "四平市" },
        { "code": "220400", "city": "辽源市" },
        { "code": "220500", "city": "通化市" },
        { "code": "220600", "city": "白山市" },
        { "code": "220700", "city": "松原市" },
        { "code": "220800", "city": "白城市" },
        { "code": "222400", "city": "延边朝鲜族自治州" }]
      },
      {
        "code": 230000,
        "title": "黑龙江省",
        "underTitle": [{ "code": "230000", "city": "黑龙江全省" },
        { "code": "230100", "city": "哈尔滨市" },
        { "code": "230200", "city": "齐齐哈尔市" },
        { "code": "230300", "city": "鸡西市" },
        { "code": "230400", "city": "鹤岗市" },
        { "code": "230500", "city": "双鸭山市" },
        { "code": "230600", "city": "大庆市" },
        { "code": "230700", "city": "伊春市" },
        { "code": "230800", "city": "佳木斯市" },
        { "code": "230900", "city": "七台河市" },
        { "code": "231000", "city": "牡丹江市" },
        { "code": "231100", "city": "黑河市" },
        { "code": "231200", "city": "绥化市" },
        { "code": "232700", "city": "大兴安岭地区" }]
      },
      {
        "code": 310000,
        "title": "上海市",
        "underTitle": [{ "city": "上海市", "code": "310000" }]
      },
      {
        "code": 320000,
        "title": "江苏省",
        "underTitle": [{ "code": "320000", "city": "江苏全省" },
        { "code": "320100", "city": "南京市" },
        { "code": "320200", "city": "无锡市" },
        { "code": "320300", "city": "徐州市" },
        { "code": "320400", "city": "常州市" },
        { "code": "320500", "city": "苏州市" },
        { "code": "320600", "city": "南通市" },
        { "code": "320700", "city": "连云港市" },
        { "code": "320800", "city": "淮安市" },
        { "code": "320900", "city": "盐城市" },
        { "code": "321000", "city": "扬州市" },
        { "code": "321100", "city": "镇江市" },
        { "code": "321200", "city": "泰州市" },
        { "code": "321300", "city": "宿迁市" }]
      },
      {
        "code": 330000,
        "title": "浙江省",
        "underTitle": [{ "code": "330000", "city": "浙江全省" },
        { "code": "330100", "city": "杭州市" },
        { "code": "330200", "city": "宁波市" },
        { "code": "330300", "city": "温州市" },
        { "code": "330400", "city": "嘉兴市" },
        { "code": "330500", "city": "湖州市" },
        { "code": "330600", "city": "绍兴市" },
        { "code": "330700", "city": "金华市" },
        { "code": "330800", "city": "衢州市" },
        { "code": "330900", "city": "舟山市" },
        { "code": "331000", "city": "台州市" },
        { "code": "331100", "city": "丽水市" }]
      },
      {
        "code": 340000,
        "title": "安徽省",
        "underTitle": [{ "code": "340000", "city": "安徽全省" },
        { "code": "340100", "city": "合肥市" },
        { "code": "340181", "city": "巢湖市" },
        { "code": "340200", "city": "芜湖市" },
        { "code": "340300", "city": "蚌埠市" },
        { "code": "340400", "city": "淮南市" },
        { "code": "340500", "city": "马鞍山市" },
        { "code": "340600", "city": "淮北市" },
        { "code": "340700", "city": "铜陵市" },
        { "code": "340800", "city": "安庆市" },
        { "code": "341000", "city": "黄山市" },
        { "code": "341100", "city": "滁州市" },
        { "code": "341200", "city": "阜阳市" },
        { "code": "341300", "city": "宿州市" },
        { "code": "341500", "city": "六安市" },
        { "code": "341600", "city": "亳州市" },
        { "code": "341700", "city": "池州市" },
        { "code": "341800", "city": "宣城市" }]
      },
      {
        "code": 350000,
        "title": "福建省",
        "underTitle": [{ "code": "350000", "city": "福建全省" },
        { "code": "350100", "city": "福州市" },
        { "code": "350200", "city": "厦门市" },
        { "code": "350300", "city": "莆田市" },
        { "code": "350400", "city": "三明市" },
        { "code": "350500", "city": "泉州市" },
        { "code": "350600", "city": "漳州市" },
        { "code": "350700", "city": "南平市" },
        { "code": "350800", "city": "龙岩市" },
        { "code": "350900", "city": "宁德市" }]
      },
      {
        "code": 360000,
        "title": "江西省",
        "underTitle": [{ "code": "360000", "city": "江西全省" },
        { "code": "360100", "city": "南昌市" },
        { "code": "360200", "city": "景德镇市" },
        { "code": "360300", "city": "萍乡市" },
        { "code": "360400", "city": "九江市" },
        { "code": "360500", "city": "新余市" },
        { "code": "360600", "city": "鹰潭市" },
        { "code": "360700", "city": "赣州市" },
        { "code": "360800", "city": "吉安市" },
        { "code": "360900", "city": "宜春市" },
        { "code": "361000", "city": "抚州市" },
        { "code": "361100", "city": "上饶市" }]
      },
      {
        "code": 370000,
        "title": "山东省",
        "underTitle": [{ "code": "370000", "city": "山东全省" },
        { "code": "370100", "city": "济南市" },
        { "code": "370200", "city": "青岛市" },
        { "code": "370300", "city": "淄博市" },
        { "code": "370400", "city": "枣庄市" },
        { "code": "370500", "city": "东营市" },
        { "code": "370600", "city": "烟台市" },
        { "code": "370700", "city": "潍坊市" },
        { "code": "370800", "city": "济宁市" },
        { "code": "370900", "city": "泰安市" },
        { "code": "371000", "city": "威海市" },
        { "code": "371100", "city": "日照市" },
        { "code": "371200", "city": "莱芜市" },
        { "code": "371300", "city": "临沂市" },
        { "code": "371400", "city": "德州市" },
        { "code": "371500", "city": "聊城市" },
        { "code": "371600", "city": "滨州市" }]
      },
      {
        "code": 410000,
        "title": "河南省",
        "underTitle": [{ "code": "410000", "city": "河南全省" },
        { "code": "410100", "city": "郑州市" },
        { "code": "410200", "city": "开封市" },
        { "code": "410300", "city": "洛阳市" },
        { "code": "410400", "city": "平顶山市" },
        { "code": "410500", "city": "安阳市" },
        { "code": "410600", "city": "鹤壁市" },
        { "code": "410700", "city": "新乡市" },
        { "code": "410800", "city": "焦作市" },
        { "code": "410900", "city": "濮阳市" },
        { "code": "411000", "city": "许昌市" },
        { "code": "411100", "city": "漯河市" },
        { "code": "411200", "city": "三门峡市" },
        { "code": "411300", "city": "南阳市" },
        { "code": "411400", "city": "商丘市" },
        { "code": "411500", "city": "信阳市" },
        { "code": "411600", "city": "周口市" },
        { "code": "411700", "city": "驻马店市" }]
      },
      {
        "code": 420000,
        "title": "湖北省",
        "underTitle": [{ "code": "420000", "city": "湖北全省" },
        { "code": "420100", "city": "武汉市" },
        { "code": "420200", "city": "黄石市" },
        { "code": "420300", "city": "十堰市" },
        { "code": "420500", "city": "宜昌市" },
        { "code": "420600", "city": "襄阳市" },
        { "code": "420700", "city": "鄂州市" },
        { "code": "420800", "city": "荆门市" },
        { "code": "420900", "city": "孝感市" },
        { "code": "421000", "city": "荆州市" },
        { "code": "421100", "city": "黄冈市" },
        { "code": "421200", "city": "咸宁市" },
        { "code": "421300", "city": "随州市" },
        { "code": "422800", "city": "恩施土家族苗族自治州" }]
      },
      {
        "code": 430000,
        "title": "湖南省",
        "underTitle": [{ "code": "430000", "city": "湖南全省" },
        { "code": "430100", "city": "长沙市" },
        { "code": "430200", "city": "株洲市" },
        { "code": "430300", "city": "湘潭市" },
        { "code": "430400", "city": "衡阳市" },
        { "code": "430500", "city": "邵阳市" },
        { "code": "430600", "city": "岳阳市" },
        { "code": "430700", "city": "常德市" },
        { "code": "430800", "city": "张家界市" },
        { "code": "430900", "city": "益阳市" },
        { "code": "431000", "city": "郴州市" },
        { "code": "431100", "city": "永州市" },
        { "code": "431200", "city": "怀化市" },
        { "code": "431300", "city": "娄底市" },
        { "code": "433100", "city": "湘西土家族苗族自治州" }]
      },
      {
        "code": 440000,
        "title": "广东省",
        "underTitle": [{ "code": "440000", "city": "广东全省" },
        { "code": "440100", "city": "广州市" },
        { "code": "440200", "city": "韶关市" },
        { "code": "440300", "city": "深圳市" },
        { "code": "440400", "city": "珠海市" },
        { "code": "440500", "city": "汕头市" },
        { "code": "440600", "city": "佛山市" },
        { "code": "440700", "city": "江门市" },
        { "code": "440800", "city": "湛江市" },
        { "code": "440900", "city": "茂名市" },
        { "code": "441200", "city": "肇庆市" },
        { "code": "441300", "city": "惠州市" },
        { "code": "441400", "city": "梅州市" },
        { "code": "441500", "city": "汕尾市" },
        { "code": "441600", "city": "河源市" },
        { "code": "441700", "city": "阳江市" },
        { "code": "441800", "city": "清远市" },
        { "code": "441900", "city": "东莞市" },
        { "code": "442000", "city": "中山市" },
        { "code": "445100", "city": "潮州市" },
        { "code": "445200", "city": "揭阳市" },
        { "code": "445300", "city": "云浮市" }]
      },
      {
        "code": 450000,
        "title": "广西壮族自治区",
        "underTitle": [{ "code": "450000", "city": "广西全省" },
        { "code": "450100", "city": "南宁市" },
        { "code": "450200", "city": "柳州市" },
        { "code": "450300", "city": "桂林市" },
        { "code": "450400", "city": "梧州市" },
        { "code": "450500", "city": "北海市" },
        { "code": "450600", "city": "防城港市" },
        { "code": "450700", "city": "钦州市" },
        { "code": "450800", "city": "贵港市" },
        { "code": "450900", "city": "玉林市" },
        { "code": "451000", "city": "百色市" },
        { "code": "451100", "city": "贺州市" },
        { "code": "451200", "city": "河池市" },
        { "code": "451300", "city": "来宾市" },
        { "code": "451400", "city": "崇左市" }]
      },
      {
        "code": 460000,
        "title": "海南省",
        "underTitle": [{ "code": "460000", "city": "海南全省" },
        { "code": "460100", "city": "海口市" },
        { "code": "460200", "city": "三亚市" }]
      },
      {
        "code": 500000,
        "title": "重庆市",
        "underTitle": [{ "city": "重庆市", "code": "500000" }]
      },
      {
        "code": 510000,
        "title": "四川省",
        "underTitle": [{ "code": "510000", "city": "四川全省" },
        { "code": "510100", "city": "成都市" },
        { "code": "510300", "city": "自贡市" },
        { "code": "510400", "city": "攀枝花市" },
        { "code": "510500", "city": "泸州市" },
        { "code": "510600", "city": "德阳市" },
        { "code": "510700", "city": "绵阳市" },
        { "code": "510800", "city": "广元市" },
        { "code": "510900", "city": "遂宁市" },
        { "code": "511000", "city": "内江市" },
        { "code": "511100", "city": "乐山市" },
        { "code": "511300", "city": "南充市" },
        { "code": "511400", "city": "眉山市" },
        { "code": "511500", "city": "宜宾市" },
        { "code": "511600", "city": "广安市" },
        { "code": "511700", "city": "达州市" },
        { "code": "511800", "city": "雅安市" },
        { "code": "511900", "city": "巴中市" },
        { "code": "512000", "city": "资阳市" },
        { "code": "513200", "city": "阿坝藏族羌族自治州" },
        { "code": "513300", "city": "甘孜藏族自治州" },
        { "code": "513400", "city": "凉山彝族自治州" }]
      },
      {
        "code": 520000,
        "title": "贵州省",
        "underTitle": [{ "code": "520000", "city": "贵州全省" },
        { "code": "520100", "city": "贵阳市" },
        { "code": "520200", "city": "六盘水市" },
        { "code": "520300", "city": "遵义市" },
        { "code": "520400", "city": "安顺市" },
        { "code": "522300", "city": "黔西南布依族苗族自治州" },
        { "code": "522600", "city": "黔东南苗族侗族自治州" },
        { "code": "522700", "city": "黔南布依族苗族自治州" }]
      },
      {
        "code": 530000,
        "title": "云南省",
        "underTitle": [{ "city": "530000", "city": "云南全省" },
        { "city": "530100", "city": "昆明市" },
        { "city": "530300", "city": "曲靖市" },
        { "city": "530400", "city": "玉溪市" },
        { "city": "530500", "city": "保山市" },
        { "city": "530600", "city": "昭通市" },
        { "city": "530700", "city": "丽江市" },
        { "city": "530900", "city": "临沧市" },
        { "city": "532300", "city": "楚雄彝族自治州" },
        { "city": "532500", "city": "红河哈尼族彝族自治州" },
        { "city": "532600", "city": "文山壮族苗族自治州" },
        { "city": "532800", "city": "西双版纳傣族自治州" },
        { "city": "532900", "city": "大理白族自治州" },
        { "city": "533100", "city": "德宏傣族景颇族自治州" },
        { "city": "533300", "city": "怒江傈僳族自治州" },
        { "city": "533400", "city": "迪庆藏族自治州" }]
      },
      {
        "code": 540000,
        "title": "西藏自治区",
        "underTitle": [{ "code": "540000", "city": "西藏全省" },
        { "code": "540100", "city": "拉萨市" },
        { "code": "542100", "city": "昌都地区" },
        { "code": "542200", "city": "山南地区" },
        { "code": "542300", "city": "日喀则地区" },
        { "code": "542400", "city": "那曲地区" },
        { "code": "542500", "city": "阿里地区" },
        { "code": "542600", "city": "林芝地区" }]
      },
      {
        "code": 610000,
        "title": "陕西省",
        "underTitle": [{ "code": "610000", "city": "陕西全省" },
        { "code": "610100", "city": "西安市" },
        { "code": "610200", "city": "铜川市" },
        { "code": "610300", "city": "宝鸡市" },
        { "code": "610400", "city": "咸阳市" },
        { "code": "610500", "city": "渭南市" },
        { "code": "610600", "city": "延安市" },
        { "code": "610700", "city": "汉中市" },
        { "code": "610800", "city": "榆林市" },
        { "code": "610900", "city": "安康市" },
        { "code": "611000", "city": "商洛市" }]
      },
      {
        "code": 620000,
        "title": "甘肃省",
        "underTitle": [{ "code": "620000", "city": "甘肃全省" },
        { "code": "620100", "city": "兰州市" },
        { "code": "620200", "city": "嘉峪关市" },
        { "code": "620300", "city": "金昌市" },
        { "code": "620400", "city": "白银市" },
        { "code": "620500", "city": "天水市" },
        { "code": "620600", "city": "武威市" },
        { "code": "620700", "city": "张掖市" },
        { "code": "620800", "city": "平凉市" },
        { "code": "620900", "city": "酒泉市" },
        { "code": "621000", "city": "庆阳市" },
        { "code": "621100", "city": "定西市" },
        { "code": "621200", "city": "陇南市" },
        { "code": "622900", "city": "临夏回族自治州" },
        { "code": "623000", "city": "甘南藏族自治州" }]
      },
      {
        "code": 630000,
        "title": "青海省",
        "underTitle": [{ "code": "630000", "city": "青海全省" },
        { "code": "630100", "city": "西宁市" },
        { "code": "632200", "city": "海北藏族自治州" },
        { "code": "632300", "city": "黄南藏族自治州" },
        { "code": "632500", "city": "海南藏族自治州" },
        { "code": "632600", "city": "果洛藏族自治州" },
        { "code": "632700", "city": "玉树藏族自治州" },
        { "code": "632800", "city": "海西蒙古族藏族自治州" }]
      },
      {
        "code": 640000,
        "title": "宁夏回族自治区",
        "underTitle": [{ "code": "640000", "city": "宁夏全省" },
        { "code": "640100", "city": "银川市" },
        { "code": "640200", "city": "石嘴山市" },
        { "code": "640300", "city": "吴忠市" },
        { "code": "640400", "city": "固原市" },
        { "code": "640500", "city": "中卫市" }]
      },
      {
        "code": 650000,
        "title": "新疆维吾尔自治区",
        "underTitle": [{ "code": "650000", "city": "新疆全省" },
        { "code": "650100", "city": "乌鲁木齐市" },
        { "code": "650200", "city": "克拉玛依市" },
        { "code": "652100", "city": "吐鲁番地区" },
        { "code": "652200", "city": "哈密地区" },
        { "code": "652300", "city": "昌吉回族自治州" },
        { "code": "652700", "city": "博尔塔拉蒙古自治州" },
        { "code": "652800", "city": "巴音郭楞蒙古自治州" },
        { "code": "652900", "city": "阿克苏地区" },
        { "code": "653000", "city": "克孜勒苏柯尔克孜自治州" },
        { "code": "653100", "city": "喀什地区" },
        { "code": "653200", "city": "和田地区" },
        { "code": "654000", "city": "伊犁哈萨克自治州" },
        { "code": "654200", "city": "塔城地区" },
        { "code": "654300", "city": "阿勒泰地区" },
        { "code": "659001", "city": "石河子市" },
        { "code": "659002", "city": "阿拉尔市" },
        { "code": "659003", "city": "图木舒克市" },
        { "code": "659004", "city": "五家渠市" }]
      },
      {
        "code": 90000,
        "title": "总局", 
        "underTitle": [{ "city": "总局", "code": "90000" }]
      }
    ]
  }
  return City
}  
  // 行业
function trade() {
  var TradeAll = {
    list: [
      {
        "code": 0,
        "title": "全部行业",
         "underTitle": [{"city": "全部行业", "code": "0"}]
      },
      {
        "code": "A",
        "title": "农、林、牧、渔业",
        "underTitle": [{ "city": "全部", "code": "A" },
        { "city": "农业", "code": "0100" },
        { "city": "林业", "code": "0200" },
        { "city": "畜牧业", "code": "0300" },
        { "city": "渔业", "code": "0400" },
        { "city": "农、林、牧、渔服务业", "code": "0500" }]
      },
      {
        "code": "B",
        "title": "采矿业",
        "underTitle": [
          { "city": "全部", "code": "B" },
          { "city": "煤炭开采和洗选业", "code": "0600" },
          { "city": "石油和天然气开采业", "code": "0700" },
          { "city": "黑色金属矿采选业", "code": "0800" },
          { "city": "有色金属矿采选业", "code": "0900" },
          { "city": "非金属矿采选业", "code": "1000" },
          { "city": "开采辅助活动", "code": "1100" },
          { "city": "其他采矿业", "code": "1200" }]
      },
      {
        "code": "C",
        "title": "制造业",
        "underTitle": [
          { "city": "全部", code: "C" },
          { "city": "农副食品加工业", "code": "1300" },
          { "city": "食品制造业", "code": "1400" },
          { "city": "酒、饮料和精制茶制造业", "code": "1500" },
          { "city": "烟草制品业", "code": "1600" },
          { "city": "纺织业", "code": "1700" },
          { "city": "纺织服装、服饰业", "code": "1800" },
          { "city": "皮革、毛皮、羽毛及其制品和制鞋业", "code": "1900" },
          { "city": "木材加工和木、竹、藤、棕、草制品业", "code": "2000" },
          { "city": "家具制造业", "code": "2100" },
          { "city": "造纸和纸制品业", "code": "2200" },
          { "city": "印刷和记录媒介复制业", "code": "2300" },
          { "city": "文教、工美、体育和娱乐用品制造业", "code": "2400" },
          { "city": "石油加工、炼焦和核燃料加工业", "code": "2500" },
          { "city": "化学原料和化学制品制造业", "code": "2600" },
          { "city": "医药制造业", "code": "2700" },
          { "city": "化学纤维制造业", "code": "2800" },
          { "city": "橡胶和塑料制品业", "code": "2900" },
          { "city": "非金属矿物制品业", "code": "3000" },
          { "city": "黑色金属冶炼和压延加工业", "code": "3100" },
          { "city": "有色金属冶炼和压延加工业", "code": "3200" },
          { "city": "金属制品业", "code": "3300" },
          { "city": "通用设备制造业", "code": "3400" },
          { "city": "专用设备制造业", "code": "3500" },
          { "city": "汽车制造业", "code": "3600" },
          { "city": "铁路、船舶、航空航天和其他运输设备制造业", "code": "3700" },
          { "city": "电气机械和器材制造业", "code": "3800" },
          { "city": "计算机、通信和其他电子设备制造业", "code": "3900" },
          { "city": "仪器仪表制造业", "code": "4000" },
          { "city": "其他制造业", "code": "4100" },
          { "city": "废弃资源综合利用业", "code": "4200" },
          { "city": "电力、热力、燃气及水生产和供应业", "code": "4300" }
        ]
      },
      {
        "code": "D",
        "title": "电力、热力、燃气及水生产和供应业",
        "underTitle": [
          {"city": "全部","code": "D"},
          {"city": "电力、热力生产和供应业", "code": "4400" },
          {"city": "燃气生产和供应业", "code": "4500" },
          {"city": "水的生产和供应业", "code": "4600" },

        ]
      },
      {
        "code": "E",
        "title": "建筑业",
        "underTitle": [
          { "city": "全部", "code": "E" },
          { "city": "房屋建筑业", "code": "4700" },
          { "city": "土木工程建筑业", "code": "4800" },
          { "city": "建筑安装业", "code": "4900" },
          { "city": "建筑装饰和其他建筑业", "code": "5000" },

        ]
      },
      {
        "code": "F",
        "title": "批发和零售业",
        "underTitle": [
          { "city": "全部", code: "F" },
          { "city": "批发业", code: "5100" },
          { "city": "零售业", code: "5200" }
        ]
      },
      {
        "code": "G",
        "title": "交通运输、仓储和邮政业",
        "underTitle": [
          { "city": "全部", "code": "G" },
          { "city": "铁路运输业", "code": "5300" },
          { "city": "道路运输业", "code": "5400" },
          { "city": "水上运输业", "code": "5500" },
          { "city": "航空运输业", "code": "5600" },
          { "city": "管道运输业", "code": "5700" },
          { "city": "装卸搬运和运输代理业", "code": "580"},
          {"city": "仓储业", "code": "5900" },
          { "city": "邮政业", "code": "6000" }

        ]
      },
      {
        "code": "H",
        "title": "住宿和餐饮业",
        "underTitle": [
          { "city": "全部", "code": "H" },
          { "city": "住宿业", "code": "6100" },
          { "city": "餐饮业", "code": "6200" }
        ]
      },
      {
        "code": "I",
        "title": "信息传输、软件和信息技术服务业",
        "underTitle": [
          { "city": "全部", code: "I" },
          { "city": "电信、广播电视和卫星传输服务", code: "6300" },
          { "city": "互联网和相关服务", code: "6400" },
          { "city": "软件和信息技术服务业", code: "6500" }

        ]
      },
      {
        "code": "J",
        "title": "金融业",
        "underTitle": [
          { "city": "全部", "code": "J" },
          { "city": "货币金融服务", "code": "6600" },
          { "city": "资本市场服务", "code": "6700" },
          { "city": "保险业", "code": "6800" },
          { "city": "其他金融业", "code": "6900" }
        ]
      },
      {
        "code": "K",
        "title": "房地产业",
        "underTitle": [
          { "city": "全部", code: "K" },
          {"city": "房地产业", code: "7000" }
        ]
      },
      {
        "code": "L",
        "title": "租赁和商务服务业",
        "underTitle": [
          { "city": "全部", "code": "L" },
          { "city": "租赁业", "code": "7100" },
          { "city": "商务服务业", "code": "7200" }
        ]
      },
      {
        "code": "M",
        "title": "科学研究和技术服务业",
        "underTitle": [
          { "city": "全部", code: "M" },
          { "city": "研究和试验发展", code: "7300" },
          { "city": "专业技术服务业", code: "7400" },
          { "city": "科技推广和应用服务业", code: "7500" }
        ]
      },
      {
        "code": "N",
        "title": "水利、环境和公共设施管理业",
        "underTitle": [
          { "city": ",全部", code: "N" },
          { "city": "水利管理业", code: "7600" },
          { "city": "生态保护和环境治理业", code: "7700" },
          { "city": "公共设施管理业", code: "7800" }
        ]
      },
      {
        "code": "O",
        "title": "居民服务、修理和其他服务业",
        "underTitle": [
          { "city": "全部", "code": "O" },
          { "city": "居民服务业", "code": "7900" },
          { "city": "机动车、电子产品和日用产品修理业", "code": "8000" },
          { "city": "其他服务业", "code": "8100" }
        ]
      },
      {
        "code": "P",
        "title": "教育",
        "underTitle": [
          { "city": "全部", code: "8200" },
          { "city": "教育", code: "8200" }
        ]
      },
      {
        "code": "Q",
        "title": "卫生和社会工作",
        "underTitle": [
          { "city": "全部", code: "Q" },
          { "city": "卫生", code: "8300" },
          { "city": "社会工作", code: "8400" }
        ]
      },
      {
        "code": "P",
        "title": "文化、体育和娱乐业",
        "underTitle": [
          { "city": "全部", code: "R" },
          { "city": "新闻和出版业", code: "8500" },
          {"city": "广播、电视、电影和影视录音制作业", code: "8600"},
          {"city": "文化艺术业", code: "8700" },
          {"city": "体育", code: "8800" },
          { "city": "娱乐业", code: "8900" }

        ]
      },
      {
        "code": "S",
        "title": "公共管理、社会保障和社会组织",
        "underTitle": [
          { "city": "全部", code: "S" },
          { "city": "人民政协、民主党派", "code": "9200" },
          { "city": "社会保障", "code": "9300" },
          { "city": "群众团体、社会团体和其他成员组织", "code": "9400" },
          { "city": "基层群众自治组织", "code": "9500" }
        ]
      },
      {
        "code": "T",
        "title": "国际组织",
        "underTitle": [
          {"city": "全部", code: "9600"},
          {"city": "国际组织", code: "9600"}
        ]
      }
    ]
  }
  return TradeAll
}
  // 资本
function capital() {
  var CapitalAll = {
    list: [
      { "capital": "不限", "code": "0-~"},
      { "capital": "0-100万", "code": "0-1000000" },
      { "capital": "100-200万", "code": "1000000-2000000" },
      { "capital": "200-500万", "code": "2000000-5000000" },
      { "capital": "500-1000万", "code": "5000000-10000000" },
      { "capital": "1000万以上", "code": "10000000-~" },
    ]
  }
  return CapitalAll
}
  // 成立时间
function time() {
  var setTime = {
    list: [
      { "capital": "不限", "code": "0-~" },
      { "capital": "成立0-1年", "code": "0-1" },
      { "capital": "成立1-2年", "code": "1-2" },
      { "capital": "成立2-3年", "code": "2-3" },
      { "capital": "成立3-4年", "code": "3-4" },
      { "capital": "成立4-5年", "code": "4-5" },
      { "capital": "成立5-8年", "code": "5-8" },
      { "capital": "成立8-10年", "code": "8-10" },
      { "capital": "成立10-15年", "code": "10-15" },
      { "capital": "成立15年以上", "code": "15-~" },
    ]
  }
  return setTime
}
  // 企业查询
function compony() {
  var componyeAll = {
    list: ["新世界", "娃哈哈", "优衣库", "乐视", "百事可乐", "格兰德", "新世界", "娃哈哈", "优衣库", "乐视", "百事可乐", "格兰德", "新世界", "娃哈哈", "优衣库", "乐视", "百事可乐", "格兰德" ]
  }
  return componyeAll
}